#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "aaafa64d20354f1bf151124136f76a33" -> "33a2c4b20b331de9220a9f6c508e144e"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4df5d7691f52560d5955787679151191" -> "45ee9e0d25243126550c44a8a1c0f633"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "64cc325ec90ea68504f6b50ce4e4bca1" -> "b739c4ce878b6bd19d47e6f7f1b83f7f"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "86bb915513edd14a57fb91b44ae8d00d" -> "6fd707423cb1203edf1e9aba143259e1"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "c341ae1bbffc22274fc31a7ea448ab8a" -> "6da9f6387c20593167fc029616fad618"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "3c6e9c74c7061f747a2897412f75ad5a" -> "640aceee3e4516f55b49cd58c3007cb4"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "ffa60d5cb2b07049816975900d2214c4" -> "ff0aa73e3ccb7af5dd77456a4d8aa29d"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "aaa32839d3b34c6ed5452595e1168ea8" -> "6356bb970f99928524f4f01ea4b367d2"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "e235172dd15cc7dd312aded7ba4acf21" -> "990b4ed7541c126ed2fc9e2b66f49859"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5dcac26e20635e5f5b08aa6fa74c64cc" -> "ef511aaa51715cb73904f01df6ce5260"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "6d05ece71b1b083336dbd8d607bdffa0" -> "e0c9ac542c13d2113b54d72cf95f6fd9"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "c00b7077af1fb38780c4395c6d2dd4be" -> "039806371ac6c24aac8743b3688cbf5c"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4cc374f6e5a8de89efaea95623f3bcb8" -> "b71ad4af2575a8b6bf454e9d0c3c2c5a"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "475ad51a40f882cc715671a05d8c1853" -> "15354f68f46fcdeff34f108150d4b6ba"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a933cb2b456fa38064aca50158484aa5" -> "abe0bdc52b4afd8c422d21e168f5b401"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "072df4221ffbc23687152072f2e09279" -> "4432d531cc5ef586c03d5581e3a132ac"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "9d9f43393edf63f563c65b968f0a2493" -> "73c88fb578a92f196132a1c94a1045e5"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "1f123b0fd7f72c50f6b76afd0ece8375" -> "c98995600fd54bc131097e9096792ca8"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "4c292f23bc02070b33992596f5fb1212" -> "ded69a9f98c322aa8d4a89f487428d8a"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8fbb1ec469b1fbb1edfb595bc18758e2" -> "5967a030d2ec9692eeebf3167a51c018"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "f77c0398f13d80e2f137e2c876ece89a" -> "ce30e3120191211958032a2157f5afb2"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "88a8d738041fcd274984ad230e0a863b" -> "75b3ee98af5894545b57c2b70c84d5aa"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6a9da0c1b445f9a7ff3e8720919779a9" -> "f834c4cda21316b29db86fb71d84ec74"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "cbd9736418ca7a78ea4077cf089e1fb2" -> "6554831f163153bd9a7b7865ffd575ed"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "040ae9d8f398d75bdf40a56b59309f64" -> "9db0437c02ff24cb74f89ea6df8087f8"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "792f2c860d44635bd57fec3e4291e91c" -> "93729a0d36bcaae8a404e6494e41a868"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "39dc456180341cfcc1a1b066b545e4e4" -> "f49945fd59ee7a5ed1c8763d9bbed468"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6e00cf7d81217d3397f1fdcd5d2be01e" -> "794928bcd18e75d9dcdf46ed78799dcc"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "33db68fb40e1aa9029b96862491da873" -> "af963f0a813e12513c27f776c96b444b"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "fd061333ad6d2e461cda907bee49c220" -> "fba5769b0427eec2280ea7bb18d47e18"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "bfd8c737950516e1ddd28e1135c45565" -> "b9710de1e01f0e7982883a1dcef6efbd"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f7cd4d4c17d95f6c474584bbf3a9cf35" -> "64d728642949e26913ca32a8e20e3d37"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "474cf58c84c75e89f1137753d8234fc0" -> "485fab0976d632c0d893575ae09c3c43"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0bf87652b964b88327162abfb2439e70" -> "7eb2802d17e0d3bae14057bc085a839b"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7b8c25db26188128d991076c12dfde4" -> "97e768eb6ee1e9df0566ec651a820b8c"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5aeeecf18cdafd21dd0a0904a8266c37" -> "62ffdedfd0c92c3debd6e466033009ae"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab19312ad691501a1ea42c977f891b53" -> "7b0260839073b3145586fd81a26b31c5"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "4d9c93dd3dca13a28707483429e987a1" -> "62149faa6604fc3d10bd2ab83219b93c"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "cd1a93977d7edf03a63d39c93f641ddf" -> "eea8d8ddaa2cfa1a67069284d2ab570b"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0dfefd94f0fc486f2dd3155cfaee19dc" -> "a511687b56a59c1ed6e4b127e9dcafac"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ce975857d3991c83ba090e543c582cbc" -> "80a31980ebffb7b34413bb5ba8adcd78"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "8ad1163529d160dd762b100389087af1" -> "b990ae055ad1f1e00f0ed6e3e1cf6ef6"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "a9818148d2fa3478936d5a2ac951aa58" -> "32cd139b9d74e949fa9a1b6cd530bc17"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "ed026282f7638c4fb0da9964a8b4690b" -> "e163bf28b17b356f96b721c7a344a07c"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4a12dff2f92a4c2591b073f3b4f9ba0d" -> "53865255b5fcf5721556c07fe6d3bda9"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "dMJ2RYetyQOoHUnk7C1mb/Ycpc2FhXeegai4TyQDQyg=" -> "6kAs3TkRjRCOWlKv2982oGumNmuPCmOM+YcebvV5BMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Vflc/oDO1NaiARlJ79MCD+NZMpnm6RW1kte4kf+H7Y=" -> "tVMaTyhn3ywtyGsG3azdqJUjeGElGVJpdUTveysvADQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pihLiUwQJu6AapPyWgxKNfK46ikiqY5+9WK5XEH8XX4=" -> "Vsgli3o2mnWEQLDLGbOIqhFXQaXwzol1VrPgioS+8+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZJF0NwOtbAvM7GM6KMWW7z9OYesOkNu4mKoh9YYxzg=" -> "NDE1g1WW1Au2+L/ZA5fVoVETC+4vztwOmtoIk0vG3uo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "ifa6ecCsSSYmcPxGFQZaJwApiEMPJwLEJBuEcWJj1Bs=" -> "0J8VALkIN1TU7ExNq+1EDOiu6DConYsgPOOrDxeRV2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "AiMC9UqpZAzTLmA/Gef9JslDtV/SePhz4rw5bos9yno=" -> "de6hTFaH70ANTSUyFL9S7KBiF2Z7gKBDAQw3K3vRhsM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPx9aVzHTKz9OJA4giT1iviLi3M5mxx4YD2YIxzkXg=" -> "4fSaLezmo7QxK5+cqKGoYD6zS1/VcUOYEQt8Jh+Cy98="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYpNueJAJ7l2Ni/a24CVJMwtTiwTrqdyh6rMpIUbZYk=" -> "ws+hNc67vOlBtOLfYsbHjagD1gK/iu1DJ51CQcFdE5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "uOZ2MS/hPze5HVwEy+FbdJW5okfwP0e6GtDDgu3ClCQ=" -> "GCy6oxlrYiimh1mobHvFYJ5TC4yMwLbIFQ4ecgmZtGU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "LoDD41PuGrhcx3LgRnB872bKkehuRJsoLBP3wSHjcCQ=" -> "Cqlj1yDFF/wiF37+SWy339GaM2y9Rl/iJHWHG1XJ8m4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qtm5VrfPzAumb1aw2oMaSyQwLOIJqo+Tf8UJows4d1o=" -> "Y2j1kVKxNnLc4r0cx9gzWrTjwwYvL5lACaOo1e5+q7s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "S7mMfi6GGx9IJpBMAY4pyUDDqTQulRlJ6iPh8mitu+4=" -> "SPXOwSUddZJI1pVJalVA5yblVZEqMSmY17cuWAAYgHE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "uigGW06hppx1vLtQxPYul/1c7Vm265YGax1V6fheCKI=" -> "xuBKDw7yiHmxNm2z9AF/7UfXx2dhk4uMH+ZSTchi/fs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "JPUQRHCHIqTevZW014IFiwqrKNoSWCQFCJaT/jCgSsk=" -> "2YNvPi83jn4Ecq2G0jeBedpnPaj6retIvGIsYdcOw0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cn/ClkTNO4cvcJ1ATyhiJa6GsDrg5CPsCrAvu1Whiyc=" -> "xahxFql93uDGSRWKzNkp9nTavrZfuuZHywI2MhOLqx0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWvfcdb+0PGXLOJaAsvY7dOosGaIAIslv7lbjyetZGI=" -> "zOse49RMboXZaWYR0TTv8N2bW5Js6jMclr6PfgWYpQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVKBGrY9hRoK/I81vCNPnU6Bp8Cu4kjO5g94yXE6pyQ=" -> "sCRQiwNatuttt5XZhmsElhD8LCj62v9PM3NdhYvx8Ac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "SpQ/P45HZnwfaTaSfW0DNQLMpU+jeS2KVfiO4iWc0qg=" -> "h6XmMuFO4t2nk5/3I0CfRQu8I0JWAcoIsYCX1qOu+s0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "K4CKRPND3HkYc+VAxoMw10LTt/JadOIlt6n1MP0Enkc=" -> "52yIYN/wKCECqOYG2NSH50Kfn3FP20w95ITMq1Z0WZ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-20T13:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "jm87YVgeseLWJCEHuz240OhiBxDYP6VHxrLLRwG0MwQ=" -> "RU0xRE4hqL6G5mhmDqLWPTLLVXZrDg/JcOljDjjNjOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mk/6A4ma0TB6i+uAYmE6J6AOozGoadGvXnDSVYfJaJ0=" -> "8XaSClcJf+scZgBPH7BWFfVvcfssYJuGnVkKCsCeb68="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EvAvj2UeUZy9E2s9RZcvIu/3QbXng/It33Arh6VrYtc=" -> "banyuTIfcJ7GNdUjdp67fF9+J9c6HZkbpU4QEKn1tVg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "FUxZsh/66ln0GO8eRoywNiReMtBunldgcgyLsoX1P6k=" -> "TSN3mcIkHxhBBfhGrwVaff+DbxDL3OR3twxam6egxM8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zm40WvcsB9TNc/n/lLSNIzuONtiUMmDPcTUPEMdmnIk=" -> "zPmP5nJHEeraIzXnbN52m6aaSeln4evyrKh8Rif46lw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFRHKuAI8DwuegERcWoPyFt5hvOkCpmoarHeGqE4Rrg=" -> "Q6cDuK7WU3mWkhq8LuYHATciozeaklRLH13fwQi6ces="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-22T19:16:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "34or47qLyr0furE1F7AF4Jp8w7c++n02wdAhKQPgqTo=" -> "Rp3L/QvYE4YziB8mIGbwCtLIinsWytRycU7hoJId7tg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ez+qbKyzvqpGbmFUsAA7uQe9AYt49tYhNK2cZl5uuB4=" -> "1QaX51Ywsr7zR7ncGtwgVFCk3SgUzxXPpanck+pkfHs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo2UWO11JBGnwI+S/V00/bq2zKztDAbL6s2drtLe6qo=" -> "CsiroqGnv4dA+wc0EsNZBkXZRmbz09daI64W7dmCQv0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "CpN7kXf5BUpDhjbkhsq7h7C3MBzf6QH6tYkjgmGLRB4=" -> "eZmBdhg8NIaXYasgq350YXRY/3gLX6EOivPFtbAyNm8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TayHhkgRq08oBb8vvpKuLWrDhXCys7lMn9WX1DwhK0I=" -> "TlOh2sGu83cvw+cfJXn2djL6DCfnOM1CDv2niciFDIk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5N6rh+9in1mbdi3B54s/pLEbkFYy6HaX5epBIC4QYxI=" -> "4dMr0V9/FN3bRB12SJnr2aHCivOtn6wDTt/52m3Quw0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "L84tKCG1qsTT7lE/qaD+GXHvZvX8lYZy1/Kl/WeVnpI=" -> "H36Ob/VfuIw6J+x/9lcPQWF5tadFAuM7ef9pL7gYoyA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "icQ4SD6Z0Rzv+Ao1v0YatTXbtWGAKir649AUhOW6rJs=" -> "jeEu3DatEbjkvdjnRll6r3Z9oloMjOF5pZ6QMVCXOBs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XDV7p7EFXK7uUyWKrqqC7yRCGY2Wz37PHw5u/rgTTGQ=" -> "LPe1ZINy7KGUOqT6VaK9v1diXRp7HQcwABnQ1w9WIlk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "3M1Cj9yZ81J8DyA1hLr4W9tGOTpDZ1bYAp/jtrJ8vqc=" -> "qw5krNB5uXDZnhmi/Coy/QiS7De1zJedaJA5MCMY21M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "WTQ3fdHgGUAUsf/cJCk5sZBpsxTXruVgqitFqUqe44I=" -> "QvRbC7yfkGK85HNUc2WTYKKeUuEYn3dhYbuqAor4Nbg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "hEd7mdbyJzq9Q4TrdZkvTjd6c/9LE5NNqvVJPwWA480=" -> "ojzeYB8O0Mhg74qwaHAAvvIZqiFJvdAGppvoivzIULA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "B5dRypOnUx0Kw+aRB1XcwvyBA+fs3cBlSC66Sdp4+wA=" -> "0iE7dpWC7GguNgr0Ry+JLlpNbbigq1X9qQErhuYuycw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ISTmuW3opF9ke6bTCLv3qInFZgiMI0TXtYyLa7H7xu0=" -> "AOU27de3DDIIXqmvaeMrwNOHGlm0mhXT6mUOcKIy++g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "+GdiKRF6JkyixBnptQEFbdEwQ1aARI2YWWZOoG7mc/g=" -> "Zk1y6gxPZ9vP09AsGfXWfPUBDFwNjgnwFlvUgZxZV9Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "2pBtKLBB4TJm2OYYC6MFDTiXTl//uP5wN3uwfbL3MSs=" -> "KEug0GPj1k+mbeeLjHtz5rS2dIaWqT0VfwSEtzRbVgc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ALCqK5jK2Ms+4Cq/ZaGIM3qkYOUpXF9VFW2Lra2zKoQ=" -> "wmDWkU5jlxAy3EWSGzwVBpdpZt9Ln/dgpXF7aSyELIg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9CBtcCh+khAXW/zd6pEp1Bok0sqX1YFYbvRvdT1PHE=" -> "0cyC4/46lXkfxvyXz/gvWiJzpZZycn7Bu9nxkBU7koU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "LDA67S1nSq2oZgjLN4yI+RszXHWfX6oTN47dst398O8=" -> "yLnZu1+MMeZ7T6pcAy8BFZN5odlc0XbqEY9Ihgnel2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-15T20:57:31Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "y2uxop" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-15T20:57:30Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-15T20:57:29Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*